# ExternalDataTypeService Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalServices..::..BuiltInExternalServices..::..ExternalDataTypeService Property
ExternalServices..::..BuiltInExternalServices Class See Also
---
Unique service id.
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ExternalServiceId ExternalDataTypeService { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ExternalDataTypeService As ExternalServiceId
	Get
```

Visual C++
---
```text
public:
static property ExternalServiceId^ ExternalDataTypeService {
	ExternalServiceId^ get ();
}
```

# See Also
ExternalServices..::..BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace